[
   "T1021.001: Remote Services: Remote Desktop Protocol (Lateral Movement) -- OilRig RDP to WATERFALLS -- RDP to 10.1.0.6 using xfreerdp\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Terminate RDP Session to Second Target (Gammu) -- End the RDP session to the second target.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection originates from the attacker's machine.\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Lateral Movement Via RDP (Arrakis) -- This ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection must originate from the attacker's machine.\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Terminate RDP Session to Domain Controller (Arrakis) -- End the RDP session to the domain controller.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection originates from the attacker's machine.\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Terminate RDP Session to Initial Target -- End the RDP session to the initial target.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection originates from the attacker's machine.\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Lateral Movement Via RDP (Toto) -- Uses discovered credentials to RDP into the next target host.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection must originate from the attacker's machine.\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Terminate RDP Session to Second Target (Toto) -- End the RDP session to the second target.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection originates from the attacker's machine.\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Lateral Movement Via RDP (Wizard) -- Uses discovered credentials to RDP into the domain controller.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection must originate from the attacker's machine.\n",
   "T1021.001: Remote Services: Remote Desktop Protocol (lateral-movement) -- Terminate RDP Session to Domain Controller -- End the RDP session to the Domain Controller.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince the RDP connection originates from the attacker's machine.\n",
   "T1021.002: Remote Services: SMB/Windows Admin Shares (lateral-movement) -- Copy Ransomware -- FIN6 utilizes cmd to copy ransomware to an internal distribution server",
   "T1021.002: Remote Services: SMB/Windows Admin Shares (lateral-movement) -- Copy Distribution Scripts -- FIN6 utilizes cmd to copy distribution scripts to an internal distribution server",
   "T1021.002: Remote Services: SMB/Windows Admin Shares (lateral-movement) -- Copy Kill Scripts -- FIN6 utilizes cmd to copy kill scripts to an internal distribution server",
   "T1021.002: Remote Services: SMB/Windows Admin Shares (lateral-movement) -- Sandworm Upload Agent to Windows Host -- Sandworm Team has pushed additional malicious tools onto an infected system to steal user credentials, move laterally, and destroy data.\nSandworm Team has used previously acquired legitimate credentials prior to attacks.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself).\n",
   "T1570: Lateral Tool Transfer (lateral-movement) -- Lateral Tool Transfer -- Previously uploaded tools are transferred to bankfileserver using pscp.exe",
   "T1570: Lateral Tool Transfer (Lateral Movement) -- Expand Access to itadmin -- Leverage PAExec to laterally move and execute on itadmin",
   "T1570: Lateral Tool Transfer (Lateral Movement) -- Copy LightNeuron transport agent DLL to the Exchange Server (Adversary) -- Task Snake to copy LightNeuron using token impersonation to perform the copy as the domain admin.\n",
   "T1570: Lateral Tool Transfer (Lateral Movement) -- Copy LightNeuron companion DLL to the Exchange Server (Adversary) -- Task Snake to copy the LightNeuron companion DLL using token impersonation to perform the copy as the domain admin.\n",
   "T1570: Lateral Tool Transfer (Lateral Movement) -- Copy PowerShell installation script to the Exchange Server (Adversary) -- Task Snake to copy PowerShell installation script to the Exchange Server using token impersonation to perform the copy as the domain admin.\n",
   "T1570: Lateral Tool Transfer (Lateral Movement) -- Copy email rules file to the Exchange server (Adversary) -- Task Snake to copy the email rules file to the Exchange server, using token impersonation to perform the copy as the domain admin.\n",
   "T1570: Lateral Tool Transfer (Lateral Movement) -- Copy config file to the Exchange server (Adversary) -- Task Snake to copy the config file to the Exchange server, using token impersonation to perform the copy as the domain admin.\n",
   "T1570: Lateral Tool Transfer (Lateral Movement) -- Download second CARBON-DLL (Adversary) -- Task CARBON-DLL to download a second version of the CARBON-DLL installer and move it to the System32 folder on the DC via the mounted drive.\n",
   "T1012: Query Registry (discovery) -- Query Registry -- The reg utility is executed via cmd to enumerate a specific Registry key associated with local system policies to ensure that the user will not be prompted for credentials when elevating permissions.",
   "T1012: Query Registry (Discovery) -- OilRig Query Registry -- Query the Windows registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Default",
   "T1087.002: Account Discovery: Domain Account (discovery) -- Enumerate AD person objects -- Find all person objects and output the results to a text file.",
   "T1087.002: Account Discovery: Domain Account (Discovery) -- OilRig Targeted \"Gosta\" Account Discovery -- The net utility is executed via cmd to enumerate detailed information about the Gosta user account",
   "T1087.002: Account Discovery: Domain Account (Discovery) -- Enumerate file server admin groups (Adversary) -- Execute the discovery command to confirm the user is in the file server admin's groups.\n",
   "T1087.002: Account Discovery: Domain Account (Discovery) -- Enumerate account information (Adversary) -- Task Snake to discover domain users.\n",
   "T1087.002: Account Discovery: Domain Account (discovery) -- TrickBot Domain Account Discovery -- Wizard Spider uses TrickBot to collect the domain users of the system.\n",
   "T1016: System Network Configuration Discovery (discovery) -- System Network Configuration Discovery -- The ipconfig utility is executed via cmd to enumerate local TCP/IP network configuration information.",
   "T1016: System Network Configuration Discovery (discovery) -- System Network Configuration Discovery -- The arp utility is executed via cmd to enumerate local ARP configuration information.",
   "T1016: System Network Configuration Discovery (discovery) -- System Network Configuration Discovery -- The netsh utility is executed via cmd to enumerate local firewall configuration information.",
   "T1016: System Network Configuration Discovery (discovery) -- Enumerate AD subnets -- List subnets and output the results to a text file.",
   "T1016: System Network Configuration Discovery (discovery) -- System Network Configuration Discovery -- Scan for nameservers and enumerate NetBIOS sessions",
   "T1016: System Network Configuration Discovery (discovery) -- System Network Configuration Discovery -- Scan for nameservers and enumerate NetBIOS sessions",
   "T1016: System Network Configuration Discovery (Discovery) -- OilRig Network Interface Configuration -- View network configuration information for host",
   "T1016: System Network Configuration Discovery (Discovery) -- OilRig Network Interface Configuration (Kali Agent) -- Attacker machine views network configuration information for gosta on 10.1.0.6",
   "T1016: System Network Configuration Discovery (Discovery) -- Perform system network configuration discovery (Adversary) -- Task LightNeuron to perform system network configuration discovery.\n",
   "T1016: System Network Configuration Discovery (discovery) -- TrickBot System Network Configuration Discovery -- Wizard Spider uses TrickBot to obtain the IP address, location, and other relevant network information from the victim’s machine.\n",
   "T1482: Domain Trust Discovery (discovery) -- Enumerate AD Organizational Units -- Enumerate all Organizational Units (OUs) in the domain of the user running the command and output the results to a text file.",
   "T1482: Domain Trust Discovery (discovery) -- Enumerate AD trust objects -- Performs a full forest search and dumps trust objects to a text file.",
   "T1482: Domain Trust Discovery (discovery) -- TrickBot Domain Trust Discovery -- Wizard Spider uses TrickBot to gather domain specfic information\n",
   "T1082: System Information Discovery (discovery) -- System Information Discovery -- The systeminfo utility is executed via cmd to enumerate local operating system configuration.",
   "T1082: System Information Discovery (discovery) -- System Information Discovery -- The net utility is executed via cmd to enumerate local operating system configuration.",
   "T1082: System Information Discovery (discovery) -- Loading Stage-2 & Performing Discovery -- Load Stage-2 from Modified Sysinternals Toolset",
   "T1082: System Information Discovery (discovery) -- Enumerate Computer Name -- Triage host for ComputerNameNetBIOS,ComputerNameDnsHostname,ComputerNameDnsDomain,ComputerNameDnsFullyQualified,ComputerNamePhysicalNetBIOS,ComputerNamePhysicalDnsHostname,ComputerNamePhysicalDnsDomain,ComputerNamePhysical,DnsFullyQualifie",
   "T1082: System Information Discovery (discovery) -- Enumerate Domain Name -- Domain triage",
   "T1082: System Information Discovery (discovery) -- OilRig Execute VBS payload to collect hostname -- Executes the payload to collect the hostname of the victim machine. \n",
   "T1082: System Information Discovery (Discovery) -- OilRig System Information Discovery -- Gather detailed system information",
   "T1082: Hide Artifacts: Hidden Files & Directories (defense-evasion) -- OilRig Set file hidden attribute -- Set file hidden attribute for contact.aspx on WATERFALLS\n",
   "T1082: System Information Discovery (discovery) -- Sandworm Initial Discovery via Webshell - Uname -- Sandworm enumerates information about the infected system's operating system by issuing shell commands through the\nPHP webshell.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince it will target patient zero. Requires curl to be installed on the attacker-controlled machine.\n",
   "T1082: System Information Discovery (discovery) -- Sandworm Windows Discovery - Windows Version Info -- Sandworm Team enumerates information about the infected system's operating system.\n",
   "T1082: System Information Discovery (Discovery) -- Systeminfo discovery (Adversary) -- Once C2 communications have been established between EPIC and the C2 via\nthe proxy server, discovery is performed on the first host where\ninformation about the host device and domain computers is collected.\n",
   "T1082: System Information Discovery (discovery) -- Emotet System Info Discovery -- Wizard Spider performs system information discovery to collect information about the OS.\n",
   "T1082: System Information Discovery (discovery) -- TrickBot System Information Discovery -- Wizard Spider uses TrickBot to gathers the OS version, machine name, CPU type, amount of RAM available, and UEFI/BIOS firmware information from the victim’s machine.\n",
   "T1082: System Information Discovery (discovery) -- TrickBot System Information Discovery (net config) -- Wizard Spider uses TrickBot to gather client specfic information\n",
   "T1018: Remote System Discovery (discovery) -- Remote System Discovery -- The net utility is executed via cmd to enumerate DCs within the domain",
   "T1018: Remote System Discovery (discovery) -- Remote System Discovery -- The net utility is executed via cmd to enumerate hosts within the domain.",
   "T1018: Remote System Discovery (discovery) -- Enumerate Domain Controller -- Get domain controller and current user SID for the domain",
   "T1018: Remote System Discovery (discovery) -- Remote System Discovery on bankfileserver -- The nslookup utility is used to find the IP address of bankdc",
   "T1018: Remote System Discovery (discovery) -- Get CFO Workstation Information from bankdc -- Get CFO Workstation Information from bankdc by running Get-ADComputer",
   "T1018: Remote System Discovery (discovery) -- Enumerate AD computer objects -- Identify all computer objects and output the results to a text file.",
   "T1018: Remote System Discovery (discovery) -- Remote System Discovery -- Identify remote systems using net",
   "T1018: Remote System Discovery (discovery) -- Remote System Discovery -- Identify remote system using Powershell",
   "T1018: Remote System Discovery (Discovery) -- OilRig nslookup WATERFALLS -- Perform DNS lookup for WATERFALLS",
   "T1018: Remote System Discovery (discovery) -- Sandworm Remote System Discovery (dsquery) -- Sandworm Enumerate all domain hosts via dsquery.exe in preparation for notpetya deployment.\n",
   "T1018: Remote System Discovery (Discovery) -- Enumerate domain computer information (Adversary) -- Task Snake to obtain a list of domain computers and some of their information (IP addresses, DNS names, and description).\n",
   "T1018: Remote System Discovery (Discovery) -- Enumerate Active Directory Computers (Adversary) -- Task CARBON-DLL to enumerate the Active Directory Computers\n",
   "T1135: Network Share Discovery (discovery) -- Network Share Discovery -- Display network shares",
   "T1518: Software Discovery (discovery) -- Detect Software -- Detect software on host",
   "T1069.002: Permission Groups Discovery: Domain Groups (discovery) -- Enumerate AD groups -- List groups and output the results to a text file.",
   "T1069.002: Permission Groups Discovery: Domain Groups (Discovery) -- OilRig Group Account Discovery -- The net utility is executed via cmd to enumerate group accounts.",
   "T1069.002: Permission Groups Discovery: Domain Groups (Discovery) -- OilRig \"domain admins\" Group Discovery -- The net utility is executed via cmd to enumerate the \"domain admins\" group",
   "T1069.002: Permission Groups Discovery: Domain Groups (Discovery) -- OilRig \"Exchange Trusted Subsystem\" Group Discovery -- The net utility is executed via cmd to enumerate the \"Exchange Trusted Subsystem\" group",
   "T1069.002: Permission Groups Discovery: Domain Groups (Discovery) -- OilRig \"SQL Admins\" Group Discovery -- The net utility is executed via cmd to enumerate the \"SQL Admins\" group",
   "T1069.002: Permission Groups Discovery: Domain Groups (Discovery) -- Execute net group discovery commands and execute `tasklist /svc` (Adversary) -- Execute net group discovery commands and execute `tasklist /svc` \n",
   "T1069.002: Permission Groups Discovery: Domain Groups (Discovery) -- Discovery on domain controller (Adversary) -- Task the new CARBON-DLL implant with discovery commands to be run on the domain controller.  \n",
   "T1069.002: Permission Groups Discovery: Domain Groups (Discovery) -- Enumerate groups (Adversary) -- Task CARBON-DLL to enumerate both groups for their members\n",
   "T1069.002: Permission Groups Discovery: Domain Groups (discovery) -- Wizard Spider Domain Group Discovery -- Wizard Spider has used AdFind to enumerate domain computers, including the domain controller.\n",
   "T1033: System Owner/User Discovery (discovery) -- System Owner / User Discovery -- The native echo command is executed via cmd to enumerate local environment variables associated with current user and domain.",
   "T1033: System Owner/User Discovery (discovery) -- Enumerate Username -- user triage",
   "T1033: System Owner/User Discovery (discovery) -- Enumerate Domain SID -- Get domain user SID",
   "T1033: System Owner/User Discovery (discovery) -- Check for Active CFO Login on CFO from BankDC -- Use qwinsta to check if the CFO user is logged into their workstation",
   "T1033: System Owner/User Discovery (discovery) -- OilRig Execute VBS payload to collect username -- Executes the payload to collect the username of the victim machine. \n",
   "T1033: System Owner/User Discovery (discovery) -- OilRig Current User (Kali Agent) -- Attacker machine obtains user from current session gosta's current session on 10.1.0.6",
   "T1033: System Owner/User Discovery (discovery) -- Sandworm Initial Discovery via Webshell - Whoami -- Sandworm collects the username from a compromised host by issuing shell commands through the PHP webshell.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince it will target patient zero. Requires curl to be installed on the attacker-controlled machine.\n",
   "T1033: System Owner/User Discovery (discovery) -- Sandworm Windows Discovery - Current User -- Sandworm Team has collected the username from a compromised host.\n",
   "T1033: System Owner/User Discovery (Discovery) -- Perform whoami discovery command (Adversary) -- Task the Carbon implant to execute the whoami discovery command.\n",
   "T1049: System Network Connections Discovery (discovery) -- 4.C.2 - System Network Connections Discovery (T1049) -- The netstat utility is executed via cmd to enumerate local active network connections.",
   "T1049: System Network Connections Discovery (Discovery) -- OilRig View Network Connections -- Find system network connections",
   "T1049: System Network Connections Discovery (Discovery) -- OilRig View Network Connections (Kali Agent) -- Attacker machine views system network connections for gosta on 10.1.0.6",
   "T1049: System Network Connections Discovery (discovery) -- Sandworm Windows Discovery - List RDP Connections -- Sandworm Team had gathered user, IP address, and server data related to RDP sessions on a compromised host.\n",
   "T1049: System Network Connections Discovery (Discovery) -- Enumerate mapped network drives (Adversary) -- Execute the discovery command to the drive mapped to the file server.\n",
   "T1049: System Network Connections Discovery (discovery) -- TrickBot System Network Connections Discovery -- Wizard Spider uses TrickBot to obtain the network connection information from the victim’s machine.\n",
   "T1046: Network Service Scanning (discovery) -- Network Service Scanning -- Enumerate remote hosts for running services using tcping",
   "T1087.001: Account Discovery: Local Account (Discovery) -- OilRig Local Account Discovery -- Enumerate user accounts",
   "T1087.001: Account Discovery: Local Account (discovery) -- TrickBot Local Account Discovery -- Wizard Spider uses TrickBot to collect the local users of the system.\n",
   "T1083: File and Directory Discovery (discovery) -- File and Directory Discovery (T1083) -- PowerShell's Get-ChildItem alias 'ls' is used to enumerate files in a remote file share.",
   "T1083: File and Directory Discovery (discovery) -- File and Directory Discovery on bankfileserver -- List directories and files within the /var/ directory on bankfileserver",
   "T1083: File and Directory Discovery (Discovery) -- OilRig File and Directory Discovery on ENDOFROAD -- Requires xdotool to be installed on the running machine. \nUses xdotool to execute file and directory discovery commands on ENDOFROAD\n",
   "T1083: File and Directory Discovery (discovery) -- Sandworm Initial Discovery via Webshell - ls -- Sandworm enumerates files on a compromised host by issuing shell commands through the PHP webshell.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince it will target patient zero. Requires curl to be installed on the attacker-controlled machine.\n",
   "T1083: File and Directory Discovery (discovery) -- Sandworm Windows Discovery - List Entire File System -- Sandworm Team has enumerated files on a compromised host.\n",
   "T1069.001: Permission Groups Discovery: Local Groups (Discovery) -- OilRig \"administrators\" local group discovery -- View the details and members of the \"administrators\" local group",
   "T1069.001: Permission Group Discovery: Domain Groups (Discovery) -- Enumerate Active Directory groups (Adversary) -- Task Snake to collect a list of Active Directory groups containing the word \"management\", as members of these groups will likely have elevated permissions on the network. Confirm existence of a \"Server Management\" group.\n",
   "T1069.001: Permission Group Discovery: Domain Groups (Discovery) -- Enumerate accounts belonging to the Server Management domain group (Adversary) -- Task Snake to obtain the usernames of accounts within the Server Management domain group. This will instruct Turla which users to target next. Confirm the domain admin user is a member.\n",
   "T1069.001: Permission Group Discovery: Domain Groups (Discovery) -- Enumerate accounts belonging to the Domain Admins domain group (Adversary) -- Task Snake to obtain the usernames of accounts within the Domain Admins domain group. Confirm the domain admin user is a member.\n",
   "T1057: Process Discovery (discovery) -- Process Discovery -- API call(s) are executed to enumerate local running processes.",
   "T1057: Process Discovery (discovery) -- Process Discovery -- The tasklist utility is executed via cmd to enumerate local running processes.",
   "T1057: Process Discovery (discovery) -- Process Discovery -- List running process on the machine via PowerShell.",
   "T1057: Process Discovery (discovery) -- Enumerate Processes -- Process triage",
   "T1057: Process Discovery (discovery) -- Process Discovery on bankfileserver -- Processes are listed on bankfileserver",
   "T1057: Process Discovery (Discovery/Execution) -- Enumerate -- Perform process discovery (T1057)",
   "T1057: Process Discovery (discovery) -- Execute PillowMint Credit Card Scraper -- Upload and execute the PillowMint credit card scraper as debug.exe",
   "T1057: Process Discovery (Discovery) -- Search for File Server Administrator process in running processes (Adversary) -- Task the Snake rootkit to run the process discovery command.\n",
   "T1057: Process Discovery (Discovery) -- Enumerate processes (Adversary) -- Task Snake to enumerate running processes on the machine to discover processes under the domain admin.\n",
   "T1057: Process Discovery (discovery) -- Emotet Process Discovery -- Emotet has been observed enumerating local processes.\n",
   "T1518.001: Software Discovery: Security Software Discovery (discovery) -- Detect Anti-Virus -- Detect anti-virus software on host",
   "T1007: System Service Discovery (discovery) -- System Service Discovery -- The sc utility is executed via cmd to enumerate local active services.",
   "T1007: System Service Discovery (discovery) -- System Service Discovery -- The net utility is executed via cmd to enumerate local active services.",
   "T1007: System Service Discovery (Discovery) -- OilRig System Service Discovery -- Gather information about registered local system services",
   "T1007: System Service Discovery (discovery) -- TrickBot System Service Discovery (systeminfo) -- Wizard Spider uses TrickBot to collect a list of installed programs and services on the system’s machine\n",
   "T1136.002: Create Account: Domain Account (Persistence) -- Create a new domain user (Adversary) -- Task Snake to create a new domain user using an access token from one of the domain admin processes. \nThe new domain user will be used as a backdoor domain admin account for persistence on the domain.\n",
   "T1136.002: Create Account: Domain Account (Persistence) -- Add the new domain user to the Domain Admins group (Adversary) -- Task Snake to create a new domain admin using the domain admin's access token.\n",
   "T1505.003: Server Software Component: Web Shell (persistence) -- OilRig Copy webshell to WATERFALLS -- contact.aspx is copied from THEBLOCK to WATERFALL to the Exchange Web Services directory. This ability implements Step 4.A.3.  \n",
   "T1505.003: Server Software Component: Web Shell (persistence) -- Sandworm Initial Compromise - Deploy Webshell -- Sandworm logs into patient zero via SSH using Valid Accounts. It is unknown how Sandworm obtained the credentials\n(perhaps an SSH password guessing attack, or zero day exploit).\nSandworm then deploys a PHP webshell for persistent access. This ability must be run by an agent running on the\nattacker-controlled machine (e.g. on the C2 server itself), since it will target patient zero. Requires sshpass\nto be installed on attacker-controlled machine (sudo apt install sshpass).\n",
   "T1505.002: Server Software Component: Transport Agent (Persistence) -- Install LightNeuron on the Exchange Server (Adversary) -- Task Snake to install LightNeuron remotely using WMI and PowerShell, using the domain admin's token\n",
   "T1548.002: Abuse Elevation Control Mechanism: Bypass User Account Control (privilege-escalation) -- UAC Bypass via Backup Utility -- Modify registry values of sdclt to bypass UAC",
   "T1548.001: Abuse Elevation Control Mechanism: Setuid and Setgid (privilege-escalation) -- Sandworm Set Up SUID for Agent Execution -- Sandworm executes the downloaded agent executable by running SUID binary /bin/backup.\nThis binary executes check.sh, which causes the agent to be executed with root privileges.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince it will target patient zero. Requires curl to be installed on the attacker-controlled machine.\n",
   "T1548.001: Abuse Elevation Control Mechanism: Setuid and Setgid (privilege-escalation) -- Sandworm Execute Agent via SUID Binary -- Sandworm executes the downloaded agent executable by running SUID binary /bin/backup.\nThis binary executes check.sh, which causes the agent to be executed with root privileges.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself),\nsince it will target patient zero. Requires curl to be installed on the attacker-controlled machine.\n",
   "T1548.001: Abuse Elevation Control Mechanism: Setuid and Setgid (privilege-escalation) -- Sandworm Wait For Priv Esc Agent Beacon -- Wait for the SUID privilege escalation to spawn an elevated agent beacon.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself).\n",
   "T1550.002: Use Alternate Authentication Material: Pass the Hash (Lateral Movement) -- Install the 3rd Snake installer on the third target host (Adversary) -- Task Snake to pass-the-hash using the previously discovered NTLM hash to run PsExec and install Snake on the target workstation.\n",
   "T1550.002: Use Alternate Authentication Material: Pass the Hash (Lateral Movement) -- Copy installer & execute using PsExec (Adversary) -- Task the CARBON-DLL implant on the domain controller to use the previously downloaded Mimikatz to pass-the-hash and (1) copy the installer to Adalwolfa's workstation and (2) execute it using PsExec.\n",
   "T1547.001: Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder (persistence) -- Set Registry Persistence on CFO -- Set Registry Persistence on CFO to run Java-Update.vbs when the CFO user logs in",
   "T1547.001: Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder (persistence) -- Registry Run Keys -- FIN6 utilizes cmd to execute Registry Run Keys",
   "T1547.001: Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder (persistence) -- Sandworm RDP to Execute Agent Implant -- RDP into target host to trigger the registry persistence which will execute the uploaded agent implant.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself).\n",
   "T1547.001: Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder (persistence) -- Sandworm Wait For Lat Move Target Beacon -- Wait for the registry persistence to trigger and for the new agent beacon to come in.\nThis ability must be run by an agent running on the attacker-controlled machine (e.g. on the C2 server itself).\n",
   "T1547.001: Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder (persistence) -- Emotet Persistence -- Wizard Spider establishes registry persistence by adding the blbdigital registry key.",
   "T1056.001: Input Capture: Keylogging (collection) -- Automated Collection (T1119) - Input Capture (T1417) -- Load custom PowerShell module, and grab keystrokes for 15 seconds.",
   "T1056.001: Input Capture: Keylogging (collection) -- Upload and Execute Keylogger on CFO as CFO -- Upload and Execute Keylogger on CFO as CFO",
   "T1056.001: Input Capture: Keylogging (collection) -- Read Keylogging Data -- Read contents of keylogger output file",
   "T1056.001: Input Capture: Keylogging (credential-access) -- Sandworm Log Keystrokes -- Sandworm runs the keylogger in the background to log keystrokes to mslog.txt.\nSandworm Team has used a keylogger to capture keystrokes by using the SetWindowsHookEx function.\n",
   "T1056.001: Input Capture: Keylogging (credential-access) -- Sandworm Let Keystroke Logger Run -- Wait 30 seconds to allow the operator to perform keystrokes for logging.\nSandworm Team has used a keylogger to capture keystrokes by using the SetWindowsHookEx function.\n",
   "T1056.001: Input Capture: Keylogging (credential-access) -- Sandworm Verify Keystroke File -- Verifies that the mslog.txt file was created.\n",
   "T1056.001: Input Capture: Keylogging (credential-access) -- Sandworm Stop Keystroke Logger -- Terminates the mslog.exe keystroke process.\n",
   "T1547.004: Boot or Logon Autostart Execution: Winlogon Helper DLL (persistence) -- Wizard Spider Registry Persistence -- Wizard Spider has established persistence using Userinit by adding the Registry key HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon.\n",
   "T1053.005: Scheduled Task/Job: Scheduled Task (persistence) -- Scheduled Task Persistence -- FIN6 utilizes cmd to execute Scheduled Tasks",
   "T1053.005: Scheduled Task/Job: Scheduled Task (Execution) -- Enumerate remote scheduled tasks (Adversary) -- Task CARBON-DLL to enumerate remote scheduled tasks on the domain controller, using the discovered password for the domain admin  \n",
   "T1053.005: Scheduled Task/Job: Scheduled Task (Persistence) -- Modify remote scheduled task (Adversary) -- Task CARBON-DLL to modify a remote scheduled task using the discovered password for the domain admin\n",
   "T1053.005: Scheduled Task/Job: Scheduled Task (Privilege Escalation) -- Execute modified scheduled task (Adversary) -- Task CARBON-DLL to remotely start the modified scheduled task on the domain controller\n",
   "T1134.001: Access Token Manipulation: Token Impersonation/Theft (privilege-escalation) -- Bypass User Account Control -- A UAC bypass technique is executed to steal the token of an existing high-integrity process and launch a new, high-integrity RAT with limited functionality.",
   "T1134.001: Access Token Manipulation: Token Impersonation/Theft (defensive-evasion) -- Remote File Copy (T1105) -- A token theft script was executed to steal and assume the token of another user’s existing process, changing the user context of the process.",
   "T1134.001: Access Token Manipulation: Token Impersonation/Theft (defensive-evasion) -- Scheduled Tasks (T1053) -- A token theft script was executed to steal and assume the token of another user’s existing process, changing the user context of the process.",
   "T1134.001: Access Token Manipulation: Token Impersonation/Theft (defensive-evasion) -- File and Directory Discovery (T1083) -- A token theft script was executed to steal and assume the token of another user’s existing process, changing the user context of the process.",
   "T1547.009: Boot or Logon Autostart Execution: Shortcut Modification (persistence) -- Persistent Service 1 -- Leverage modified Sysinternals",
   "T1547.009: Boot or Logon Autostart Execution: Shortcut Modification (persistence) -- Persistent Service 2 -- Leverage modified Sysinternals",
   "T1546.011: Application Shimming (Persistence) -- Execute Application Shim Persistence -- Reboot the host to start shim persistence.",
   "T1546.003: Event Triggered Execution: Windows Management Instrumentation Event Subscription (persistence) -- WMI Persistence technique -- user triage",
   "T1055: Process Injection (privilege-escalation) -- Process Injection -- The limited functionality high-integrity RAT will inject malicious code into an existing fully functional high-integrity process, resulting in a new elevated, fully functional high-integrity RAT.",
   "T1543.002: Create or Modify System Process: Systemd Service (persistence) -- Sandworm Establish Systemd Persistence -- Sandworm establishes systemd persistence.\n",
   "T1134.002: Access Token Manipulation: Create Process with Token (defensive-evasion) -- UAC Bypass via sdctl -- Invoke UAC bypass sdctl",
   "T1053.003: Scheduled Task/Job: Cron (persistence) -- Sandworm Establish Crontab Persistence -- Sandworm establishes crontab persistence.\n",
   "T1574.001: Hijack Execution Flow - DLL Search Order Hijacking (Hijack Execution Flow - DLL Search Order Hijacking) -- Privilege Escalation -- Perform DLL hijack to escalate privileges.",
   "T1574.011: Hijack Execution Flow: Services Registry Permissions Weakness (Privilege Escalation) -- Modify the ViperVPN service registry key (Adversary) -- Modify the ViperVPN service registry key\n"
]